import s from './StoresLocationForm.module.css';
import { Controller } from 'react-hook-form';
import TextField from '@mui/material/TextField';
import Autocomplete from '@mui/material/Autocomplete';

const countriesList = [
  'Афганістан',
  'Албанія',
  'Алжир',
  'Андорра',
  'Ангола',
  'Антигуа і Барбуда',
  'Аргентина',
  'Вірменія',
  'Австралія',
  'Австрія',
  'Азербайджан',
  'Багамські Острови',
  'Бахрейн',
  'Бангладеш',
  'Барбадос',
  'Білорусь',
  'Бельгія',
  'Беліз',
  'Бенін',
  'Бутан',
  'Болівія',
  'Боснія і Герцеговина',
  'Ботсвана',
  'Бразилія',
  'Бруней',
  'Болгарія',
  'Буркіна-Фасо',
  'Бурунді',
  'Кабо-Верде',
  'Камбоджа',
  'Камерун',
  'Канада',
  'Центральноафриканська Республіка',
  'Чад',
  'Чилі',
  'Китай',
  'Колумбія',
  'Коморські Острови',
  'Конго',
  'Коста-Рика',
  'Хорватія',
  'Куба',
  'Кіпр',
  'Чеська Республіка',
  'Данія',
  'Джібуті',
  'Домініка',
  'Домініканська Республіка',
  'Еквадор',
  'Єгипет',
  'Сальвадор',
  'Екваторіальна Гвінея',
  'Еритрея',
  'Естонія',
  'Есватіні',
  'Ефіопія',
  'Фіджі',
  'Фінляндія',
  'Франція',
  'Габон',
  'Гамбія',
  'Грузія',
  'Німеччина',
  'Гана',
  'Греція',
  'Гренада',
  'Гватемала',
  'Гвінея',
  'Гвінея-Бісау',
  'Гаяна',
  'Гаїті',
  'Гондурас',
  'Угорщина',
  'Ісландія',
  'Індія',
  'Індонезія',
  'Іран',
  'Ірак',
  'Ірландія',
  'Ізраїль',
  'Італія',
  'Ямайка',
  'Японія',
  'Йорданія',
  'Казахстан',
  'Кенія',
  'Кірибаті',
  'Північна Корея',
  'Південна Корея',
  'Косово',
  'Кувейт',
  'Киргизстан',
  'Лаос',
  'Латвія',
  'Ліван',
  'Лесото',
  'Ліберія',
  'Лівія',
  'Ліхтенштейн',
  'Литва',
  'Люксембург',
  'Мадагаскар',
  'Малаві',
  'Малайзія',
  'Мальдіви',
  'Малі',
  'Мальта',
  'Маршаллові Острови',
  'Мавританія',
  'Маврікій',
  'Мексика',
  'Мікронезія',
  'Молдова',
  'Монако',
  'Монголія',
  'Чорногорія',
  'Марокко',
  'Мозамбік',
  "М'янма",
  'Намібія',
  'Науру',
  'Непал',
  'Нідерланди',
  'Нова Зеландія',
  'Нікарагуа',
  'Нігер',
  'Нігерія',
  'Північна Македонія',
  'Норвегія',
  'Оман',
  'Пакистан',
  'Палау',
  'Панама',
  'Папуа-Нова Гвінея',
  'Парагвай',
  'Перу',
  'Філіппіни',
  'Польща',
  'Португалія',
  'Катар',
  'Румунія',
  'Росія',
  'Руанда',
  'Сент-Кітс і Невіс',
  'Сент-Люсія',
  'Сент-Вінсент і Гренадіни',
  'Самоа',
  'Сан-Марино',
  'Сан-Томе і Принсіпі',
  'Саудівська Аравія',
  'Сенегал',
  'Сербія',
  'Сейшельські Острови',
  'Сьєрра-Леоне',
  'Сінгапур',
  'Словаччина',
  'Словенія',
  'Соломонові Острови',
  'Сомалі',
  'ПАР',
  'Південний Судан',
  'Іспанія',
  'Шрі-Ланка',
  'Судан',
  'Суринам',
  'Свазіленд',
  'Швеція',
  'Швейцарія',
  'Сирія',
  'Таджикистан',
  'Танзанія',
  'Таїланд',
  'Того',
  'Тонга',
  'Тринідад і Тобаго',
  'Туніс',
  'Туреччина',
  'Туркменістан',
  'Тувалу',
  'Уганда',
  'Україна',
  "Об'єднані Арабські Емірати",
  'Велика Британія',
  'США',
  'Уругвай',
  'Узбекистан',
  'Вануату',
  'Ватикан',
  'Венесуела',
  "В'єтнам",
  'Ємен',
  'Замбія',
  'Зімбабве',
];
const regionList = [
  'Вінницька',
  'Волинська',
  'Дніпропетровська',
  'Донецька',
  'Житомирська',
  'Закарпатська',
  'Запорізька',
  'Івано-Франківська',
  'Київська',
  'Кіровоградська',
  'Луганська',
  'Львівська',
  'Миколаївська',
  'Одеська',
  'Полтавська',
  'Рівненська',
  'Сумська',
  'Тернопільська',
  'Харківська',
  'Херсонська',
  'Хмельницька',
  'Черкаська',
  'Чернівецька',
  'Чернігівська',
];

const citiesList = [
  'Київ',
  'Харків',
  'Одеса',
  'Дніпро',
  'Львів',
  'Вінниця',
  'Херсон',
  'Полтава',
  'Чернігів',
  'Житомир',
  'Суми',
  'Тернопіль',
  'Луцьк',
  'Ужгород',
  'Сімферополь',
  'Севастополь',
  'Рівне',
  'Черкаси',
  'Хмельницький',
  'Чернівці',
  'Луганськ',
  'Івано-Франківськ',
  'Кривий Ріг',
  'Миколаїв',
  'Маріуполь',
  'Донецьк',
  'Запоріжжя',
  'Хмільник',
  'Лубни',
  'Прилуки',
  'Миргород',
  'Олександрія',
  'Шостка',
  'Кропивницький',
  'Мелітополь',

  'Біла Церква',
  'Ірпінь',
  'Бровари',
  'Кам`янець-Подільський',

  'Мукачеве',
  'Коломия',
  'Дрогобич',

  'Ізмаїл',
  'Жмеринка',
  'Бердянськ',

  'Євпаторія',
  'Артемівськ',

  'Білгород-Дністровський',
  'Віньниця',
  'Горлівка',

  'Ізюм',
  'Краматорськ',
  'Лисичанськ',
  'Макіївка',
  'Марганець',
  'Нікополь',
  'Пологи',
  'Сєвєродонецьк',
  'Старобільськ',
];

const selectStyles = {
  '& .MuiFormControl-root': {
    padding: '20px',
  },
};

export default function StoresLocationForm({ control }) {
  return (
    <>
      <Controller
        control={control}
        name="country"
        defaultValue={countriesList[180]}
        render={({ field: { ref, onChange, ...field } }) => (
          <Autocomplete
            options={countriesList}
            onChange={(_, data) => onChange(data)}
            defaultValue={countriesList[180]}
            className={s.autocompleteWrapper}
            renderInput={params => (
              <TextField
                {...params}
                {...field}
                fullWidth
                inputRef={ref}
                label="Країна"
                variant="standard"
              />
            )}
          />
        )}
      />
      <Controller
        control={control}
        name="region"
        defaultValue={regionList[23]}
        render={({ field: { ref, onChange, ...field } }) => (
          <Autocomplete
            options={regionList}
            onChange={(_, data) => onChange(data)}
            defaultValue={regionList[23]}
            className={s.autocompleteWrapper}
            renderInput={params => (
              <TextField
                {...params}
                {...field}
                fullWidth
                inputRef={ref}
                label="Область"
                variant="standard"
              />
            )}
          />
        )}
      />
      <Controller
        control={control}
        name="citi"
        defaultValue={citiesList[8]}
        render={({ field: { ref, onChange, ...field } }) => (
          <Autocomplete
            options={citiesList}
            onChange={(_, data) => onChange(data)}
            defaultValue={citiesList[8]}
            className={`${s.autocompleteWrapper} ${s.autocompletelastChild}`}
            freeSolo
            renderInput={params => (
              <TextField
                {...params}
                {...field}
                fullWidth
                inputRef={ref}
                label="Місто"
                variant="standard"
              />
            )}
          />
        )}
      />
      <Controller
        control={control}
        name="street"
        defaultValue=""
        render={({ field }) => (
          <TextField
            {...field}
            className={s.customInput}
            label="Вулиця"
            type="search"
            variant="standard"
          />
        )}
      />

      <div className={s.houseApartmentWrapper}>
        <Controller
          control={control}
          name="houseNumber"
          defaultValue={0}
          render={({ field }) => (
            <TextField
              {...field}
              className={s.customInput}
              label="Будинок"
              type="number"
              InputLabelProps={{ className: s.customLabel }}
              variant="standard"
            />
          )}
        />
        <Controller
          control={control}
          name="apartment"
          defaultValue={0}
          render={({ field }) => (
            <TextField
              {...field}
              className={s.customInput}
              sx={selectStyles}
              label="Квартира"
              type="number"
              variant="standard"
            />
          )}
        />
      </div>
    </>
  );
}
